experiments/results/logs/trace_replay-hybrid-008/wrk2.txt
Running 30m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 4092.712ms, rate sampling interval: 12115ms
  Thread calibration: mean lat.: 4124.508ms, rate sampling interval: 11902ms
  Thread calibration: mean lat.: 4167.387ms, rate sampling interval: 12156ms
  Thread calibration: mean lat.: 4077.442ms, rate sampling interval: 11804ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.70m     5.58m   18.82m    53.58%
    Req/Sec     9.10      5.56    75.00     97.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.15m 
 75.000%   14.88m 
 90.000%   17.06m 
 99.000%   18.39m 
 99.900%   18.63m 
 99.990%   18.75m 
 99.999%   18.84m 
100.000%   18.84m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6488.063     0.000000            1         1.00
   97189.887     0.100000         6885         1.11
  204341.247     0.200000        13776         1.25
  323223.551     0.300000        20656         1.43
  515112.959     0.400000        27571         1.67
  609222.655     0.500000        34434         2.00
  664272.895     0.550000        37881         2.22
  707264.511     0.600000        41314         2.50
  756023.295     0.650000        44744         2.86
  805830.655     0.700000        48194         3.33
  892862.463     0.750000        51657         4.00
  915406.847     0.775000        53376         4.44
  936378.367     0.800000        55079         5.00
  959447.039     0.825000        56818         5.71
  982515.711     0.850000        58536         6.67
 1002438.655     0.875000        60238         8.00
 1012924.415     0.887500        61105         8.89
 1023410.175     0.900000        61974        10.00
 1034420.223     0.912500        62815        11.43
 1045430.271     0.925000        63709        13.33
 1054343.167     0.937500        64552        16.00
 1059061.759     0.943750        64987        17.78
 1063780.351     0.950000        65393        20.00
 1069023.231     0.956250        65836        22.86
 1074790.399     0.962500        66288        26.67
 1080033.279     0.968750        66684        32.00
 1084227.583     0.971875        66954        35.56
 1087373.311     0.975000        67156        40.00
 1090519.039     0.978125        67358        45.71
 1093664.767     0.981250        67546        53.33
 1097859.071     0.984375        67829        64.00
 1098907.647     0.985938        67898        71.11
 1101004.799     0.987500        68028        80.00
 1102053.375     0.989062        68093        91.43
 1104150.527     0.990625        68236       106.67
 1105199.103     0.992188        68300       128.00
 1106247.679     0.992969        68358       142.22
 1107296.255     0.993750        68417       160.00
 1108344.831     0.994531        68467       182.86
 1109393.407     0.995313        68513       213.33
 1111490.559     0.996094        68603       256.00
 1111490.559     0.996484        68603       284.44
 1112539.135     0.996875        68640       320.00
 1113587.711     0.997266        68670       365.71
 1114636.287     0.997656        68705       426.67
 1114636.287     0.998047        68705       512.00
 1115684.863     0.998242        68736       568.89
 1115684.863     0.998437        68736       640.00
 1116733.439     0.998633        68755       731.43
 1116733.439     0.998828        68755       853.33
 1117782.015     0.999023        68772      1024.00
 1118830.591     0.999121        68789      1137.78
 1118830.591     0.999219        68789      1280.00
 1118830.591     0.999316        68789      1462.86
 1119879.167     0.999414        68800      1706.67
 1119879.167     0.999512        68800      2048.00
 1120927.743     0.999561        68807      2275.56
 1120927.743     0.999609        68807      2560.00
 1121976.319     0.999658        68814      2925.71
 1121976.319     0.999707        68814      3413.33
 1123024.895     0.999756        68821      4096.00
 1123024.895     0.999780        68821      4551.11
 1123024.895     0.999805        68821      5120.00
 1124073.471     0.999829        68825      5851.43
 1124073.471     0.999854        68825      6826.67
 1124073.471     0.999878        68825      8192.00
 1125122.047     0.999890        68826      9102.22
 1126170.623     0.999902        68827     10240.00
 1127219.199     0.999915        68828     11702.86
 1127219.199     0.999927        68828     13653.33
 1128267.775     0.999939        68829     16384.00
 1129316.351     0.999945        68831     18204.44
 1129316.351     0.999951        68831     20480.00
 1129316.351     0.999957        68831     23405.71
 1129316.351     0.999963        68831     27306.67
 1129316.351     0.999969        68831     32768.00
 1130364.927     0.999973        68833     36408.89
 1130364.927     1.000000        68833          inf
#[Mean    =   581872.420, StdDeviation   =   334659.305]
#[Max     =  1129316.352, Total count    =        68833]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  69194 requests in 30.00m, 686.30MB read
  Socket errors: connect 0, read 0, write 0, timeout 25194
  Non-2xx or 3xx responses: 4509
Requests/sec:     38.44
Transfer/sec:    390.37KB